Revit 2027 API
DuctPressureDropData.DynamicViscosity Property
 The dynamic viscosity of the air in the duct. Units: (kg/(ft*s)).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DynamicViscosity { get; }
Public ReadOnly Property DynamicViscosity As Double
	Get
public:
property double DynamicViscosity {
	double get ();
}
member DynamicViscosity : float with get
Property Value
Double
See Also
Reference
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace